Саракташ2/src/Catalogs/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыДоставки</name>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СборКурьерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыделятьЦветом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DPD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/Catalogs/СпособыДоставки/Forms/ВводНовойСтоимости/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	
	Если Стоимость <> СтараяСтоимость И Стоимость <> 0 Тогда
		ЗаписатьНовуюЦену();
		Закрыть(Истина);
	Иначе
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтараяСтоимость = Параметры.СтараяСтоимость;
	ВидЦен = Параметры.ВидЦен;
	СпособДоставки = Параметры.СпособДоставки;
	Стоимость = СтараяСтоимость;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовуюЦену()
	
	Док = Документы.УстановкаЦен.СоздатьДокумент();
	Док.ВидЦен = ВидЦен;
	Док.Дата = ТекущаяДата();
	нс = Док.Цены.Добавить();
	нс.Номенклатура = СпособДоставки;
	нс.Цена = Стоимость;
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
